0/fluidVolume/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    channelWalls
    {
        type            zeroGradient;
        value           uniform 300;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    outlet
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    topWalls
    {
        type            zeroGradient;
        value           uniform 300;
    }
    outerWalls
    {
        type            zeroGradient;
        value           uniform 300;
    }
    tankWalls
    {
        type            zeroGradient;
        value           uniform 300;
    }
    fluidVolume_to_solidVolume
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        neighbourFieldName T;
        K               K;
    }
}


// ************************************************************************* //
