0/fluidVolume/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1e-05;

boundaryField
{
    channelWalls
    {
        type            compressible::kqRWallFunction;
        value           uniform 1e-10;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    outlet
    {
        type            inletOutlet;
        value           uniform 1e-05;
        inletValue      uniform 1e-05;
    }
    topWalls
    {
        type            compressible::kqRWallFunction;
        value           uniform 1e-10;
    }
    outerWalls
    {
        type            compressible::kqRWallFunction;
        value           uniform 1e-10;
    }
    tankWalls
    {
        type            compressible::kqRWallFunction;
        value           uniform 1e-10;
    }
    fluidVolume_to_solidVolume
    {
        type            compressible::kqRWallFunction;
        value           uniform 1e-10;
    }
}


// ************************************************************************* //
