0/fluidVolume/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 8000;

boundaryField
{
    channelWalls
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    topWalls
    {
        type            calculated;
        value           uniform 0;
    }
    outerWalls
    {
        type            calculated;
        value           uniform 0;
    }
    tankWalls
    {
        type            calculated;
        value           uniform 0;
    }
    fluidVolume_to_solidVolume
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
