0/solidVolume/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 1 -3 -1 0 0 0 ];

internalField   uniform 80;

boundaryField
{
    solidWalls
    {
        type            zeroGradient;
        value           uniform 80;
    }
    solidVolume_to_fluidVolume
    {
        type            zeroGradient;
        value           uniform 80;
    }
}


// ************************************************************************* //
